In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('lidar_etrs89.csv',delimiter=',')
df.head()

   Name  Height  OSGB36-East  OSGB36-North  UTM29N-East  UTM29N-North
0     0   -5.71     91995.51      13995.50    694067.63    5536193.53
1     1   -5.71     91996.51      13995.50    694068.63    5536193.63
2     2   -5.73     91997.51      13995.50    694069.62    5536193.72
3     3   -5.74     91998.51      13995.50    694070.62    5536193.81
4     4   -5.74     91999.51      13995.51    694071.61    5536193.92

In [3]:
df=df.drop(columns=['Name','OSGB36-East','OSGB36-North'])
df.head()

   Height  UTM29N-East  UTM29N-North
0   -5.71    694067.63    5536193.53
1   -5.71    694068.63    5536193.63
2   -5.73    694069.62    5536193.72
3   -5.74    694070.62    5536193.81
4   -5.74    694071.61    5536193.92

In [4]:
df=df.rename(columns={'UTM29N-East':'E','UTM29N-North':'N'})

In [5]:
print(df)

          Height          E           N
0          -5.71  694067.63  5536193.53
1          -5.71  694068.63  5536193.63
2          -5.73  694069.62  5536193.72
3          -5.74  694070.62  5536193.81
4          -5.74  694071.61  5536193.92
...          ...        ...         ...
5963035 -9999.00  696714.58  5538458.35
5963036 -9999.00  696715.58  5538458.44
5963037 -9999.00  696716.57  5538458.53
5963038 -9999.00  696717.57  5538458.63
5963039 -9999.00  696718.56  5538458.72

[5963040 rows x 3 columns]

In [6]:
df[df==-9999]=None
print(df)

         Height          E           N
0         -5.71  694067.63  5536193.53
1         -5.71  694068.63  5536193.63
2         -5.73  694069.62  5536193.72
3         -5.74  694070.62  5536193.81
4         -5.74  694071.61  5536193.92
...         ...        ...         ...
5963035     NaN  696714.58  5538458.35
5963036     NaN  696715.58  5538458.44
5963037     NaN  696716.57  5538458.53
5963038     NaN  696717.57  5538458.63
5963039     NaN  696718.56  5538458.72

[5963040 rows x 3 columns]

In [9]:
df=df.dropna()

In [10]:
print(df)

         Height          E           N
0         -5.71  694067.63  5536193.53
1         -5.71  694068.63  5536193.63
2         -5.73  694069.62  5536193.72
3         -5.74  694070.62  5536193.81
4         -5.74  694071.61  5536193.92
...         ...        ...         ...
5962668   -4.27  696349.44  5538424.07
5962669   -4.24  696350.44  5538424.17
5962670   -4.21  696351.43  5538424.26
5962671   -4.18  696352.43  5538424.35
5962672   -4.16  696353.42  5538424.45

[5692680 rows x 3 columns]

In [11]:
df['CD']=df['Height']+2.91
df.head()

   Height          E           N    CD
0   -5.71  694067.63  5536193.53 -2.80
1   -5.71  694068.63  5536193.63 -2.80
2   -5.73  694069.62  5536193.72 -2.82
3   -5.74  694070.62  5536193.81 -2.83
4   -5.74  694071.61  5536193.92 -2.83

In [12]:
df=df.drop(columns='Height')
df.head()

           E           N    CD
0  694067.63  5536193.53 -2.80
1  694068.63  5536193.63 -2.80
2  694069.62  5536193.72 -2.82
3  694070.62  5536193.81 -2.83
4  694071.61  5536193.92 -2.83

In [13]:
df.to_csv('LIDAR ETRS89_CD.csv',index=False)
df.to_csv('LIDAR ETRS89_CD.txt',index=False)